import os
from dotenv import load_dotenv

load_dotenv()

class Settings():
    
    BOT_TOKEN = os.getenv('BOT_TOKEN')          # токен бота из BotFather
    YANDEX_DISK_TOKEN = os.getenv("YANDEX_DISK_TOKEN")
    YANDEX_DISK_URL = "https://cloud-api.yandex.net/v1/disk/resources/upload"
    
    #---------------------------База данных----------------------------------
    DB_FILE = 'bot_data.db'                     # название и путь вашей базы данных SQLite
    #------------------------------------------------------------------------
    
    #--------------------------Файлы json------------------------------------
    FILE_PATH = 'json/machines_data.json'       # файл данных станков
    FILE_PATH_ACCESS = 'json/access_user.json'  # файл доступа пользователей
    FILE_CONTACTS = 'json/contact.json'         # файл контактов
    SETTINGS_FILE = "json/auto_backup.json"     # файл интервалов автокопирования БД
    FILE_ALARM = 'json/alarm_840D.json'         # файл ошибок Sinumerik 840D
    #------------------------------------------------------------------------
    
    #-------------------------Папки------------------------------------------
    TEMP_DIR = 'temp files'                     # папка для хранения временных PDF поиска
    MANUALS_DIR = 'manuals'                     # папка для хранения руководств
    DIR_DB = 'backup'                           # папка для бекапов базы данных
    #------------------------------------------------------------------------
    
    #-------------------------Логи-------------------------------------------
    LOG_FILES = ['logs/bot.log',                # ротируемые файлы логов
                 'logs/bot.log.1',
                 'logs/bot.log.2'] 
    #------------------------------------------------------------------------
    
    #-------------------------Константы--------------------------------------
    CLEANUP_INTERVAL: int = 3600                # интервал автоочистки файлов из temp_files в секундах
    MANUALS_PER_PAGE = 6                        # количество кнопок на странице (3 ряда по 2 кнопки)
    BUTTONS_IN_ROW = 2                          # количество кнопок в строке в руководствах
    MAX_FILE_SIZE_MB = 50                       # максимальный размер файла для загрузки в руководства
    ALLOWED_EXTENSIONS = ('.pdf', '.txt')       # разрешенные файлы для загрузки в руководства
    MAX_FILENAME_LENGTH = 50                    # максимальная длина названия
    INTERVAL_NAMES = {                          # имена диапазонов автокопирования БД
        "daily": "раз в день",
        "weekly": "раз в неделю",
        "monthly": "раз в месяц",
        "off": "отключено"
    }
    INTERVAL_SECONDS = {                        # диапазоны автокопирования БД в секундах
        "daily": 24 * 3600,
        "weekly": 7 * 24 * 3600,
        "monthly": 30 * 24 * 3600,
        "off": 0
    }
    #-----------------------------------------------------------------------
    
    #--------------------------Прочее---------------------------------------
    PHOTO_SECRET = os.getenv('PHOTO_URL')
    #-----------------------------------------------------------------------
    
settings = Settings()







